# Sign Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShapeConstraintAngleFromFixedDir..::..Sign Property
RebarShapeConstraintAngleFromFixedDir Class See Also
---
When the sign is 1, the Direction is rotated clockwise by the angle's value. When -1, the Direction is rotated counter-clockwise.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public int Sign { get; set; }
```

Visual Basic
---
```text
Public Property Sign As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int Sign {
	int get ();
	void set (int value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: sign is not 1 or -1. |

# See Also
RebarShapeConstraintAngleFromFixedDir Class
Autodesk.Revit.DB.Structure Namespace